'''
[문제7] 모스 부호 해독
문자열 형식으로 입력받은 모스 부호(dot: . dash:-)를 해독하여 영어 문장으로 출력하는 프로그램을 작성해 보자.

글자와 글자 사이는 공백 하나, 단어와 단어 사이는 공백 두개로 구분한다.
예를 들어 다음 모스부호는 "HE SLEEPS EARLY"로 해석해야 한다.

.... .  ... .-.. . . .--. ...  . .- .-. .-.. -.--
모스부호 규칙 표

문자	부호	문자	부호
A	.-	N	-.
B	-...	O	---
C	-.-.	P	.--.
D	-..	Q	--.-
E	.	R	.-.
F	..-.	S	...
G	--.	T	-
H	....	U	..-
I	..	V	...-
J	.---	W	.--
K	-.-	X	-..-
L	.-..	Y	-.--
M	--	Z	--..
'''
print(ord("A")) #대문자 ASCII : 65시작, 소문자 : 90 시작
list = [".-","-...","-.-.","-..",".","..-.","--.","....","..",".---","-.-",".-..","--","-.","---",".--.","--.-",".-.","...","-","..-","...-",".--","-..-","-.--","--.."]
data = ".... .  ... .-.. . . .--. ...  . .- .-. .-.. -.--"
dataList = data.split(" ")
print(dataList)
answer = ""
for char in dataList :
    if char == '' :
        answer = answer + " "
    else :
        for n in range(0, len(list)) :
            if list[n] == char :
                answer = answer + chr(n+65)

print(answer)

'''
답
dic = {
    '.-':'A','-...':'B','-.-.':'C','-..':'D','.':'E','..-.':'F',
    '--.':'G','....':'H','..':'I','.---':'J','-.-':'K','.-..':'L',
    '--':'M','-.':'N','---':'O','.--.':'P','--.-':'Q','.-.':'R',
    '...':'S','-':'T','..-':'U','...-':'V','.--':'W','-..-':'X',
    '-.--':'Y','--..':'Z'
} ## 저자는 Dictionary 씀

def morse(src):
    result = []
    for word in src.split("  "): ## 띄어쓰기 구분
        for char in word.split(" "): ## 글자 구분
            result.append(dic[char]) ## 글자 찾기
        result.append(" ") ## 띄어쓰기인 경우 space 추가
    return "".join(result)


print(morse('.... .  ... .-.. . . .--. ...  . .- .-. .-.. -.--'))
'''